Poco-Ye/ZLG_lpc1765_ametal/ametal/lpc5410x/hw/include/lpc5410x_pin.h
/*******************************************************************************
*                                 Apollo
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2014 Guangzhou ZHIYUAN Electronics Stock Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
* e-mail:      apollo.support@zlg.cn
*******************************************************************************/

/**
 * \file
 * \brief LPC5410x GPIO 引脚配置参数定义
 * 
 * \internal
 * \par Modification History
 * - 1.00 15-01-06  hbt, first implementation.
 * \endinternal
 */

#ifndef __LPC5410X_PIN_H
#define __LPC5410X_PIN_H

#ifdef __cplusplus
extern "C" {
#endif

#include "amdr_gpio_util.h"

 /** 
 * \addtogroup amhw_if_pin
 * \copydoc lpc5410x_pin.h
 * @{
 */


/** 
 * \name LPC5410x GPIO 引脚编号
 * @{
 */

#define PIO0_0          0        /**< \brief PIO0_0引脚号  */
#define PIO0_1          1        /**< \brief PIO0_1引脚号  */
#define PIO0_2          2        /**< \brief PIO0_2引脚号  */
#define PIO0_3          3        /**< \brief PIO0_3引脚号  */
#define PIO0_4          4        /**< \brief PIO0_4引脚号  */
#define PIO0_5          5        /**< \brief PIO0_5引脚号  */
#define PIO0_6          6        /**< \brief PIO0_6引脚号  */
#define PIO0_7          7        /**< \brief PIO0_7引脚号  */
#define PIO0_8          8        /**< \brief PIO0_8引脚号  */
#define PIO0_9          9        /**< \brief PIO0_9引脚号  */
#define PIO0_10         10       /**< \brief PIO0_10引脚号 */
#define PIO0_11         11       /**< \brief PIO0_11引脚号 */
#define PIO0_12         12       /**< \brief PIO0_12引脚号 */
#define PIO0_13         13       /**< \brief PIO0_13引脚号 */
#define PIO0_14         14       /**< \brief PIO0_14引脚号 */
#define PIO0_15         15       /**< \brief PIO0_15引脚号 */
#define PIO0_16         16       /**< \brief PIO0_16引脚号 */
#define PIO0_17         17       /**< \brief PIO0_17引脚号 */
#define PIO0_18         18       /**< \brief PIO0_18引脚号 */
#define PIO0_19         19       /**< \brief PIO0_19引脚号 */
#define PIO0_20         20       /**< \brief PIO0_20引脚号 */
#define PIO0_21         21       /**< \brief PIO0_21引脚号 */
#define PIO0_22         22       /**< \brief PIO0_22引脚号 */
#define PIO0_23         23       /**< \brief PIO0_23引脚号 */
#define PIO0_24         24       /**< \brief PIO0_24引脚号 */
#define PIO0_25         25       /**< \brief PIO0_25引脚号 */
#define PIO0_26         26       /**< \brief PIO0_26引脚号 */
#define PIO0_27         27       /**< \brief PIO0_27引脚号 */
#define PIO0_28         28       /**< \brief PIO0_28引脚号 */
#define PIO0_29         29       /**< \brief PIO0_29引脚号 */
#define PIO0_30         30       /**< \brief PIO0_30引脚号 */
#define PIO0_31         31       /**< \brief PIO0_31引脚号 */

#define PIO1_0          32       /**< \brief PIO1_0引脚号  */
#define PIO1_1          33       /**< \brief PIO1_1引脚号  */
#define PIO1_2          34       /**< \brief PIO1_2引脚号  */
#define PIO1_3          35       /**< \brief PIO1_3引脚号  */
#define PIO1_4          36       /**< \brief PIO1_4引脚号  */
#define PIO1_5          37       /**< \brief PIO1_5引脚号  */
#define PIO1_6          38       /**< \brief PIO1_6引脚号  */
#define PIO1_7          39       /**< \brief PIO1_7引脚号  */
#define PIO1_8          40       /**< \brief PIO1_8引脚号  */
#define PIO1_9          41       /**< \brief PIO1_9引脚号  */
#define PIO1_10         42       /**< \brief PIO1_10引脚号 */
#define PIO1_11         43       /**< \brief PIO1_11引脚号 */
#define PIO1_12         44       /**< \brief PIO1_12引脚号 */
#define PIO1_13         45       /**< \brief PIO1_13引脚号 */
#define PIO1_14         46       /**< \brief PIO1_14引脚号 */
#define PIO1_15         47       /**< \brief PIO1_15引脚号 */
#define PIO1_16         48       /**< \brief PIO1_16引脚号 */
#define PIO1_17         49       /**< \brief PIO1_17引脚号 */

/** @} */


#ifdef AM_CORTEX_M4

/** 
 * \brief 使用Cortex-M4内核时，支持最大引脚中断数是8，
 * 使用Cortex-M0+内核时，支持最大引脚中断数是4.
*/
#define PIN_INT_MAX     8  
#endif

#ifdef AM_CORTEX_M0

/** 
 * \brief 使用Cortex-M4内核时，支持最大引脚中断数是8，
 * 使用Cortex-M0+内核时，支持最大引脚中断数是4.
*/
#define PIN_INT_MAX     4  
#endif


/**
 * \name GPIO 功能模式
 *       作为函数 am_gpio_pin_cfg() 的第二个参数，例如：
 *       am_gpio_pin_cfg(PIO0_4, AMDR_GPIO_OUPUT)
 * @{
 */
 
/** \brief 消极模式(无上拉/下拉) */
#define AMDR_GPIO_INACTIVE     AMDR_GPIO_MODE_CODE(0x0)

/** \brief 下拉模式 */
#define AMDR_GPIO_PULLDOWN     AMDR_GPIO_MODE_CODE(0x1)

/** \brief 上拉模式 */
#define AMDR_GPIO_PULLUP       AMDR_GPIO_MODE_CODE(0x2)

/** \brief 中继模式 */
#define AMDR_GPIO_REPEATER     AMDR_GPIO_MODE_CODE(0x3)

/** @} */

/******************************************************************************/

/**
 * \name PIO0_0引脚功能
 * @{
 */

#define PIO0_0_GPIO            AMDR_GPIO_FUNC_CODE(0x0)    /**< \brief GPIO          */
#define PIO0_0_INPUT           AMDR_GPIO_DIR_CODE(0x0)     /**< \brief 输入           */
#define PIO0_0_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)     /**< \brief 输出           */
#define PIO0_0_USART0_RXD      AMDR_GPIO_FUNC_CODE(0x1)    /**< \brief USART0_RXD     */
#define PIO0_0_SPI0_SSELN0     AMDR_GPIO_FUNC_CODE(0x2)    /**< \brief SPI0_SSELN0    */
#define PIO0_0_CT0_CAP0        AMDR_GPIO_FUNC_CODE(0x3)    /**< \brief CT0_CAP0       */
#define PIO0_0_SCT0_OUT3       AMDR_GPIO_FUNC_CODE(0x5)    /**< \brief SCT0_OUT3      */

/** @} */

/**
 * \name PIO0_0功能模式
 * @{
 */

#define PIO0_0_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)    /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_0_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)    /**< \brief 下拉模式              */
#define PIO0_0_PULLUP          AMDR_GPIO_MODE_CODE(0x2)    /**< \brief 上拉模式              */
#define PIO0_0_REPEATER        AMDR_GPIO_MODE_CODE(0x3)    /**< \brief 中继模式              */
                                                                                      
/** @} */

/**
 * \name PIO0_0 输入极性
 * @{
 */
#define PIO0_0_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_0_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_0 输入干扰滤波
 * @{
 */
#define PIO0_0_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_0_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_0 驱动回转速率
 * @{
 */
#define PIO0_0_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)      /**< \brief 标准模式 */
#define PIO0_0_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)      /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_0 开漏模式
 * @{
 */
#define PIO0_0_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO0_0_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_1引脚功能
 * @{
 */

#define PIO0_1_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO            */
#define PIO0_1_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入            */
#define PIO0_1_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出            */
#define PIO0_1_USART0_TXD      AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief USART0_TXD      */
#define PIO0_1_SPI0_SSELN1     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SPI0_SSELN1     */
#define PIO0_1_CT0_CAP1        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_CAP1        */
#define PIO0_1_SCT0_OUT1       AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief SCT0_OUT1       */

/** @} */

/**
 * \name PIO0_1功能模式
 * @{
 */
 
#define PIO0_1_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_1_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO0_1_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO0_1_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_1 输入极性
 * @{
 */
#define PIO0_1_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_1_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_1 输入干扰滤波
 * @{
 */
#define PIO0_1_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_1_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_1 驱动回转速率
 * @{
 */
#define PIO0_1_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)      /**< \brief 标准模式 */
#define PIO0_1_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)      /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_1 开漏模式
 * @{
 */
#define PIO0_1_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO0_1_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_2引脚功能
 * @{
 */

#define PIO0_2_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO     */
#define PIO0_2_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入     */
#define PIO0_2_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出     */
#define PIO0_2_CTS             AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief CTS      */
#define PIO0_2_CT2_CAP1        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT2_CAP1 */
/** @} */

/**
 * \name PIO0_2功能模式
 * @{
 */
 
