Poco-Ye/ZLG_lpc1765_ametal/ametal/lpc5410x/hw/include/lpc5410x_pin.h
#define PIO0_2_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_2_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO0_2_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO0_2_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_2 输入极性
 * @{
 */
#define PIO0_2_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_2_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_2 输入干扰滤波
 * @{
 */
#define PIO0_2_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_2_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_2 驱动回转速率
 * @{
 */
#define PIO0_2_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)      /**< \brief 标准模式 */
#define PIO0_2_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)      /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_2 开漏模式
 * @{
 */
#define PIO0_2_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO0_2_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_3引脚功能
 * @{
 */

#define PIO0_3_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO       */
#define PIO0_3_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入       */
#define PIO0_3_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出       */
#define PIO0_3_USART0_RTS      AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief USQRT0_RTS */
#define PIO0_3_CT1_MAT3        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT1_MAT3   */

/** @} */

/**
 * \name PIO0_3功能模式
 * @{
 */
 
#define PIO0_3_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_3_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO0_3_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO0_3_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_3 输入极性
 * @{
 */
#define PIO0_3_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_3_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_3 输入干扰滤波
 * @{
 */
#define PIO0_3_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_3_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_3 驱动回转速率
 * @{
 */
#define PIO0_3_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)      /**< \brief 标准模式 */
#define PIO0_3_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)      /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_3 开漏模式
 * @{
 */
#define PIO0_3_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO0_3_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_4引脚功能
 * @{
 */

#define PIO0_4_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO0_4_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO0_4_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO0_4_USART0_SCLK     AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief USART0_SCLK */
#define PIO0_4_SPI0_SSELN2     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SPI0_SSELN2 */
#define PIO0_4_CT0_CAP2        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_CAP2    */

/** @} */


/**
 * \name PIO0_4功能模式
 * @{
 */
 
#define PIO0_4_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_4_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO0_4_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO0_4_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_4 输入极性
 * @{
 */
#define PIO0_4_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_4_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_4 输入干扰滤波
 * @{
 */
#define PIO0_4_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_4_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_4 驱动回转速率
 * @{
 */
#define PIO0_4_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)      /**< \brief 标准模式 */
#define PIO0_4_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)      /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_4 开漏模式
 * @{
 */
#define PIO0_4_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO0_4_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_5引脚功能
 * @{
 */

#define PIO0_5_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO       */
#define PIO0_5_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入       */
#define PIO0_5_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出       */
#define PIO0_5_USART1_RXD      AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief USART1_RXD */
#define PIO0_5_SCT0_OUT6       AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SCT0_OUT6  */
#define PIO0_5_CT0_MAT0        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_MAT0   */

/** @} */

/**
 * \name PIO0_5功能模式
 * @{
 */
 
#define PIO0_5_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_5_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO0_5_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO0_5_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_5 输入极性
 * @{
 */
#define PIO0_5_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_5_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_5 输入干扰滤波
 * @{
 */
#define PIO0_5_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_5_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_5 驱动回转速率
 * @{
 */
#define PIO0_5_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)      /**< \brief 标准模式 */
#define PIO0_5_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)      /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_5 开漏模式
 * @{
 */
#define PIO0_5_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO0_5_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_6引脚功能
 * @{
 */

