Poco-Ye/ZLG_lpc1765_ametal/ametal/lpc5410x/hw/include/lpc5410x_pin.h
#define PIO0_6_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO       */
#define PIO0_6_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入       */
#define PIO0_6_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出       */
#define PIO0_6_USART1_TXD      AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief USART1_TXD */
#define PIO0_6_CT0_MAT1        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_MAT1   */
                               
/** @} */

/**
 * \name PIO0_6功能模式
 * @{
 */
 
#define PIO0_6_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_6_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO0_6_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO0_6_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_6 输入极性
 * @{
 */
#define PIO0_6_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_6_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_6 输入干扰滤波
 * @{
 */
#define PIO0_6_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_6_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_6 驱动回转速率
 * @{
 */
#define PIO0_6_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)      /**< \brief 标准模式 */
#define PIO0_6_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)      /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_6 开漏模式
 * @{
 */
#define PIO0_6_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO0_6_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_7引脚功能
 * @{
 */

#define PIO0_7_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO0_7_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO0_7_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO0_7_USART1_SCLK     AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief USART1_SCLK */
#define PIO0_7_SCT0_OUT0       AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SCT0_OUT0   */
#define PIO0_7_CT0_MAT2        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_MAT2    */
#define PIO0_7_CT0_CAP2        AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief CT0_CAP2    */

/** @} */

/**
 * \name PIO0_7功能模式
 * @{
 */
 
#define PIO0_7_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_7_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO0_7_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO0_7_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_7 输入极性
 * @{
 */
#define PIO0_7_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_7_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_7 输入干扰滤波
 * @{
 */
#define PIO0_7_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_7_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_7 驱动回转速率
 * @{
 */
#define PIO0_7_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)      /**< \brief 标准模式 */
#define PIO0_7_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)      /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_7 开漏模式
 * @{
 */
#define PIO0_7_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO0_7_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_8引脚功能
 * @{
 */

#define PIO0_8_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO       */
#define PIO0_8_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入       */
#define PIO0_8_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出       */
#define PIO0_8_USART2_RXD      AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief USART2_RXD */
#define PIO0_8_SCT0_OUT1       AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SCT0_OUT1  */
#define PIO0_8_CT0_MAT3        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_MAT3   */

/** @} */

/**
 * \name PIO0_8功能模式
 * @{
 */
 
#define PIO0_8_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_8_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO0_8_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO0_8_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_8 输入极性
 * @{
 */
#define PIO0_8_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_8_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_8 输入干扰滤波
 * @{
 */
#define PIO0_8_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_8_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_8 驱动回转速率
 * @{
 */
#define PIO0_8_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)      /**< \brief 标准模式 */
#define PIO0_8_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)      /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_8 开漏模式
 * @{
 */
#define PIO0_8_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO0_8_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_9引脚功能
 * @{
 */

#define PIO0_9_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO0_9_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO0_9_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO0_9_USART2_TXD      AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief USART2_TXD  */
#define PIO0_9_SCT0_OUT2       AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SCT0_OUT2   */
#define PIO0_9_CT3_CAP0        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT3_CAP0    */
#define PIO0_9_SPI0_SSELN0     AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief SPI0_SSELN0 */

/** @} */

/**
 * \name PIO0_9功能模式
 * @{
 */
 
#define PIO0_9_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_9_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO0_9_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO0_9_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_9 输入极性
 * @{
 */
#define PIO0_9_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_9_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_9 输入干扰滤波
 * @{
 */
#define PIO0_9_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_9_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_9 驱动回转速率
 * @{
 */
#define PIO0_9_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)      /**< \brief 标准模式 */
#define PIO0_9_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)      /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_9 开漏模式
 * @{
 */
#define PIO0_9_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO0_9_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_10引脚功能
 * @{
 */

#define PIO0_10_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO0_10_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO0_10_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO0_10_USART2_SCLK    AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief USART2_SCLK */
#define PIO0_10_SCT0_OUT3      AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SCT0_OUT3   */
#define PIO0_10_CT3_MAT0       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT3_MAT0    */

/** @} */

/**
 * \name PIO0_10功能模式
 * @{
 */
 
#define PIO0_10_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_10_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_10_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_10_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_10 输入极性
 * @{
 */
#define PIO0_10_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_10_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_10 输入干扰滤波
 * @{
 */
#define PIO0_10_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_10_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_10 驱动回转速率
 * @{
 */
#define PIO0_10_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_10_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_10 开漏模式
 * @{
 */
#define PIO0_10_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_10_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_11引脚功能
 * @{
 */

#define PIO0_11_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO       */
#define PIO0_11_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入       */
#define PIO0_11_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出       */
#define PIO0_11_SPI0_SCK       AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief SPI0_SCK   */
#define PIO0_11_USART1_RXD     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief USART1_RXD */
#define PIO0_11_CT2_MAT1       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT2_MAT1   */

/** @} */

/**
 * \name PIO0_11功能模式
 * @{
 */
 
#define PIO0_11_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_11_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_11_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_11_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_11 输入极性
 * @{
 */
#define PIO0_11_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_11_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_11 输入干扰滤波
 * @{
 */
#define PIO0_11_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_11_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_11 驱动回转速率
 * @{
 */
#define PIO0_11_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_11_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_11 开漏模式
 * @{
 */
#define PIO0_11_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_11_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_12引脚功能
 * @{
 */

#define PIO0_12_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO       */
#define PIO0_12_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入       */
#define PIO0_12_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出       */
#define PIO0_12_SPI0_MOSI      AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief SPI0_MOSI  */
#define PIO0_12_USART1_TXD     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief USART1_TXD */
#define PIO0_12_CT2_MAT3       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT2_MAT3   */

/** @} */

/**
 * \name PIO0_12功能模式
 * @{
 */
 
#define PIO0_12_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_12_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_12_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_12_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_12 输入极性
 * @{
 */
#define PIO0_12_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_12_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_12 输入干扰滤波
 * @{
 */
#define PIO0_12_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_12_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_12 驱动回转速率
 * @{
 */
#define PIO0_12_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_12_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_12 开漏模式
 * @{
 */
#define PIO0_12_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_12_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_13引脚功能
 * @{
 */

#define PIO0_13_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO      */
#define PIO0_13_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入      */
#define PIO0_13_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出      */
#define PIO0_13_SPI0_MISO      AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief SPI0_MISO */
#define PIO0_13_SCT0_OUT4      AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SCT0_OUT4 */
#define PIO0_13_CT2_MAT0       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT2_MAT0  */

/** @} */

/**
 * \name PIO0_13功能模式
 * @{
 */
 
#define PIO0_13_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_13_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_13_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_13_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_13 输入极性
 * @{
 */
#define PIO0_13_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_13_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_13 输入干扰滤波
 * @{
 */
#define PIO0_13_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_13_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_13 驱动回转速率
 * @{
 */
#define PIO0_13_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_13_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_13 开漏模式
 * @{
 */
#define PIO0_13_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_13_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_14引脚功能
 * @{
 */

