Poco-Ye/ZLG_lpc1765_ametal/ametal/lpc5410x/hw/include/lpc5410x_pin.h
#define PIO0_14_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO0_14_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO0_14_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO0_14_SPI0_SSELN0    AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief SPI0_SSELN0 */
#define PIO0_14_SCT0_OUT5      AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SCT0_OUT5   */
#define PIO0_14_CT2_MAT1       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT2_MAT1    */

/** @} */

/**
 * \name PIO0_14功能模式
 * @{
 */
 
#define PIO0_14_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_14_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_14_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_14_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_14 输入极性
 * @{
 */
#define PIO0_14_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_14_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_14 输入干扰滤波
 * @{
 */
#define PIO0_14_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_14_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_14 驱动回转速率
 * @{
 */
#define PIO0_14_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_14_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_14 开漏模式
 * @{
 */
#define PIO0_14_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_14_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_15引脚功能
 * @{
 */

#define PIO0_15_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO0_15_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO0_15_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO0_15_SPI0_SSELN1    AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief SPI0_SSELN1 */
#define PIO0_15_SWO            AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SWO         */
#define PIO0_15_CT2_MAT2       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT2_MAT2    */

/** @} */

/**
 * \name PIO0_15功能模式
 * @{
 */
 
#define PIO0_15_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_15_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_15_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_15_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_15 输入极性
 * @{
 */
#define PIO0_15_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_15_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_15 输入干扰滤波
 * @{
 */
#define PIO0_15_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_15_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_15 驱动回转速率
 * @{
 */
#define PIO0_15_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_15_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_15 开漏模式
 * @{
 */
#define PIO0_15_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_15_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_16引脚功能
 * @{
 */

#define PIO0_16_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO0_16_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO0_16_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO0_16_SPI0_SSELN2    AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief SPI0_SSELN2 */
#define PIO0_16_USART1_CTS     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief USART1_CTS  */
#define PIO0_16_CT3_MAT1       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT3_MAT1    */
#define PIO0_16_SWCLK_TCK      AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief SWCLK_TCK   */

/** @} */

/**
 * \name PIO0_16功能模式
 * @{
 */
 
#define PIO0_16_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_16_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_16_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_16_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_16 输入极性
 * @{
 */
#define PIO0_16_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_16_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_16 输入干扰滤波
 * @{
 */
#define PIO0_16_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_16_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_16 驱动回转速率
 * @{
 */
#define PIO0_16_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_16_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_16 开漏模式
 * @{
 */
#define PIO0_16_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_16_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_17引脚功能
 * @{
 */

#define PIO0_17_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO0_17_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO0_17_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO0_17_SPI0_SSELN3    AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief SPI0_SSELN3 */
#define PIO0_17_USART1_RTS     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief USART1_RTS  */
#define PIO0_17_CT3_MAT2       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT3_MAT2    */
#define PIO0_17_SWDIO          AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief SWDIO       */

/** @} */

/**
 * \name PIO0_17功能模式
 * @{
 */
 
