Poco-Ye/ZLG_lpc1765_ametal/ametal/lpc5410x/hw/include/lpc5410x_pin.h
#define PIO0_17_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_17_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_17_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_17_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_17 输入极性
 * @{
 */
#define PIO0_17_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_17_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_17 输入干扰滤波
 * @{
 */
#define PIO0_17_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_17_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_17 驱动回转速率
 * @{
 */
#define PIO0_17_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_17_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_17 开漏模式
 * @{
 */
#define PIO0_17_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_17_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_18引脚功能
 * @{
 */

#define PIO0_18_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO       */
#define PIO0_18_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入       */
#define PIO0_18_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出       */
#define PIO0_18_USART3_TXD     AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief USART3_TXD */
#define PIO0_18_SCT0_OUT0      AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SCT0_OUT0  */
#define PIO0_18_CT0_MAT0       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_MAT0   */

/** @} */

/**
 * \name PIO0_18功能模式
 * @{
 */
 
#define PIO0_18_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_18_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_18_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_18_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_18 输入极性
 * @{
 */
#define PIO0_18_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_18_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_18 输入干扰滤波
 * @{
 */
#define PIO0_18_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_18_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_18 驱动回转速率
 * @{
 */
#define PIO0_18_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_18_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_18 开漏模式
 * @{
 */
#define PIO0_18_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_18_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_19引脚功能
 * @{
 */

#define PIO0_19_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO0_19_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO0_19_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO0_19_USART3_SCLK    AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief USART3_SCLK */
#define PIO0_19_SCT0_OUT1      AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SCT0_OUT1   */
#define PIO0_19_CT0_MAT1       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_MAT1    */

/** @} */

/**
 * \name PIO0_19功能模式
 * @{
 */
 
#define PIO0_19_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_19_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_19_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_19_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_19 输入极性
 * @{
 */
#define PIO0_19_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_19_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_19 输入干扰滤波
 * @{
 */
#define PIO0_19_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_19_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_19 驱动回转速率
 * @{
 */
#define PIO0_19_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_19_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_19 开漏模式
 * @{
 */
#define PIO0_19_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_19_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_20引脚功能
 * @{
 */

#define PIO0_20_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO0_20_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO0_20_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO0_20_USART3_RXD     AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief USART3_RXD  */
#define PIO0_20_USART0_SCLK    AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief USART0_SCLK */
#define PIO0_20_CT3_CAP0       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT3_CAP0    */

/** @} */

/**
 * \name PIO0_20功能模式
 * @{
 */
 
#define PIO0_20_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_20_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_20_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_20_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_20 输入极性
 * @{
 */
#define PIO0_20_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_20_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_20 输入干扰滤波
 * @{
 */
#define PIO0_20_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_20_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_20 驱动回转速率
 * @{
 */
#define PIO0_20_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_20_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_20 开漏模式
 * @{
 */
#define PIO0_20_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_20_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_21引脚功能
 * @{
 */

#define PIO0_21_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO       */
#define PIO0_21_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入       */
#define PIO0_21_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出       */
#define PIO0_21_CLKOUT         AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief CLKOUT     */
#define PIO0_21_USART0_TXD     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief USART0_TXD */
#define PIO0_21_CT3_MAT0       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT3_MAT0   */
/** @} */

/**
 * \name PIO0_21功能模式
 * @{
 */
 
#define PIO0_21_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_21_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_21_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_21_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_21 输入极性
 * @{
 */
#define PIO0_21_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_21_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_21 输入干扰滤波
 * @{
 */
#define PIO0_21_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_21_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_21 驱动回转速率
 * @{
 */
#define PIO0_21_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_21_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_21 开漏模式
 * @{
 */
#define PIO0_21_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_21_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_22引脚功能
 * @{
 */

