Poco-Ye/ZLG_lpc1765_ametal/ametal/lpc5410x/hw/include/lpc5410x_pin.h
#define PIO0_22_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO       */
#define PIO0_22_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入       */
#define PIO0_22_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出       */
#define PIO0_22_CLKIN          AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief CLKIN      */
#define PIO0_22_USART0_RXD     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief USART0_RXD */
#define PIO0_22_CT3_MAT3       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT3_MAT3   */

/** @} */

/**
 * \name PIO0_22功能模式
 * @{
 */
 
#define PIO0_22_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_22_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_22_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_22_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_22 输入极性
 * @{
 */
#define PIO0_22_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_22_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_22 输入干扰滤波
 * @{
 */
#define PIO0_22_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_22_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_22 驱动回转速率
 * @{
 */
#define PIO0_22_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO0_22_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO0_22 开漏模式
 * @{
 */
#define PIO0_22_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_22_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO0_23引脚功能
 * @{
 */

#define PIO0_23_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO      */
#define PIO0_23_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入      */
#define PIO0_23_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出      */ 
#define PIO0_23_I2C0_SCL       AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief I2C0_SCL  */
#define PIO0_23_CT0_CAP0       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_CAP0  */

/** @} */

/**
 * \name PIO0_23 控制I2C引脚回转速率
 * @{
 */
#define PIO0_23_SLEWDISABLE    AMDR_GPIO_I2CSLEWBIT_CODE(0x0)   /**< \brief I2C模式   */
#define PIO0_23_SLEWENABLE     AMDR_GPIO_I2CSLEWBIT_CODE(0x1)   /**< \brief GPIO模式  */
/** @} */

/**
 * \name PIO0_23 输入极性
 * @{
 */
#define PIO0_23_INVDISABLE     AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_23_INVENABLE      AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_23 输入干扰滤波
 * @{
 */
#define PIO0_23_FILDISABLE     AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_23_FILENABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_23 控制引脚的电流驱动能力
 * @{
 */
#define PIO0_23_DRIVEDISABLE    AMDR_GPIO_I2CDRIVE_CODE(0x0)    /**< \brief 低驱动   */
#define PIO0_23_DRIVEENABLE     AMDR_GPIO_I2CDRIVE_CODE(0x1)    /**< \brief 高驱动   */
/** @} */

/**
 * \name PIO0_23 配置I2C的特性：标准模式、快速模式和超快速模式等
 * @{
 */
#define PIO0_23_FILTERENABLE    AMDR_GPIO_I2CFILTER_CODE(0x0)   /**< \brief 50 ns 脉冲滤波使能 */
#define PIO0_23_FILTERDISABLE   AMDR_GPIO_I2CFILTER_CODE(0x1)   /**< \brief 50 ns 脉冲滤波禁能 */
/** @} */

/**
 * \name PIO0_23 引脚的I2C功能
 * @{
 */

#define PIO0_23_4MA_DRIVE       AMDR_PIO_4MA_DRIVE              /**< \brief GPIO 4 mA驱动    */
#define PIO0_23_20MA_DRIVE      AMDR_PIO_20MA_DRIVE             /**< \brief GPIO 20 mA驱动   */
#define PIO0_23_STD_I2C         AMDR_FAST_STD_MODE              /**< \brief I2C快速/标准模式 */
#define PIO0_23_MOD_PLU_IIC     AMDR_FAST_MODE_PLUS             /**< \brief I2C超快速模式    */
#define PIO0_23_HIGH_I2C        AMDR_HIGH_SPEED_SLAVE           /**< \brief I2C高速从机模式  */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_24引脚功能
 * @{
 */

#define PIO0_24_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO      */
#define PIO0_24_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入      */
#define PIO0_24_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出      */
#define PIO0_24_I2C0_SDA       AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief I2C0_SDA  */
#define PIO0_24_CT0_CAP1       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_CAP1  */                         
#define PIO0_24_CT0_MAT0       AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief CT0_MAT0  */
/** @} */

/**
 * \name PIO0_24 控制I2C引脚回转速率
 * @{
 */
#define PIO0_24_SLEWDISABLE    AMDR_GPIO_I2CSLEWBIT_CODE(0x0)   /**< \brief I2C模式   */
#define PIO0_24_SLEWENABLE     AMDR_GPIO_I2CSLEWBIT_CODE(0x1)   /**< \brief GPIO模式  */
/** @} */

/**
 * \name PIO0_24 输入极性
 * @{
 */
#define PIO0_24_INVDISABLE     AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_24_INVENABLE      AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_24 输入干扰滤波
 * @{
 */
#define PIO0_24_FILDISABLE     AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_24_FILENABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_24 控制引脚的电流驱动能力
 * @{
 */
#define PIO0_24_DRIVEDISABLE    AMDR_GPIO_I2CDRIVE_CODE(0x0)    /**< \brief 低驱动   */
#define PIO0_24_DRIVEENABLE     AMDR_GPIO_I2CDRIVE_CODE(0x1)    /**< \brief 高驱动   */
/** @} */

/**
 * \name PIO0_24 配置I2C的特性：标准模式、快速模式和超快速模式等
 * @{
 */
#define PIO0_24_FILTERENABLE    AMDR_GPIO_I2CFILTER_CODE(0x0)   /**< \brief 50 ns 脉冲滤波使能 */
#define PIO0_24_FILTERDISABLE   AMDR_GPIO_I2CFILTER_CODE(0x1)   /**< \brief 50 ns 脉冲滤波禁能 */
/** @} */

/**
 * \name PIO0_24 引脚的I2C功能
 * @{
 */

#define PIO0_24_4MA_DRIVE      AMDR_PIO_4MA_DRIVE               /**< \brief GPIO 4 mA驱动    */
#define PIO0_24_20MA_DRIVE     AMDR_PIO_20MA_DRIVE              /**< \brief GPIO 20 mA驱动   */
#define PIO0_24_STD_I2C        AMDR_FAST_STD_MODE               /**< \brief I2C快速/标准模式 */
#define PIO0_24_MOD_PLU_IIC    AMDR_FAST_MODE_PLUS              /**< \brief I2C超快速模式    */
#define PIO0_24_HIGH_I2C       AMDR_HIGH_SPEED_SLAVE            /**< \brief I2C高速从机模式  */

/** @} */


/******************************************************************************/

/**
 * \name PIO0_25引脚功能
 * @{
 */

