Poco-Ye/ZLG_lpc1765_ametal/ametal/lpc5410x/hw/include/lpc5410x_pin.h
#define PIO0_25_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO       */
#define PIO0_25_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入       */
#define PIO0_25_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出       */
#define PIO0_25_I2C1_SCL       AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief I2C1_SCL   */
#define PIO0_25_USART1_CTS     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief USART1_CTS */
#define PIO0_25_CT0_CAP2       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_CAP2   */ 
#define PIO0_25_CT1_CAP1       AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief CT1_CAP1   */

/** @} */

/**
 * \name PIO0_25 控制I2C引脚回转速率
 * @{
 */
#define PIO0_25_SLEWDISABLE    AMDR_GPIO_I2CSLEWBIT_CODE(0x0)   /**< \brief I2C模式   */
#define PIO0_25_SLEWENABLE     AMDR_GPIO_I2CSLEWBIT_CODE(0x1)   /**< \brief GPIO模式  */
/** @} */

/**
 * \name PIO0_25 输入极性
 * @{
 */
#define PIO0_25_INVDISABLE     AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_25_INVENABLE      AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_25 输入干扰滤波
 * @{
 */
#define PIO0_25_FILDISABLE     AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_25_FILENABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_25 控制引脚的电流驱动能力
 * @{
 */
#define PIO0_25_DRIVEDISABLE   AMDR_GPIO_I2CDRIVE_CODE(0x0)     /**< \brief 低驱动   */
#define PIO0_25_DRIVEENABLE    AMDR_GPIO_I2CDRIVE_CODE(0x1)     /**< \brief 高驱动   */
/** @} */

/**
 * \name PIO0_25 配置I2C的特性：标准模式、快速模式和超快速模式等
 * @{
 */
#define PIO0_25_FILTERENABLE   AMDR_GPIO_I2CFILTER_CODE(0x0)    /**< \brief 50 ns 脉冲滤波使能 */
#define PIO0_25_FILTERDISABLE  AMDR_GPIO_I2CFILTER_CODE(0x1)    /**< \brief 50 ns 脉冲滤波禁能 */
/** @} */

/**
 * \name PIO0_25 引脚的I2C功能
 * @{
 */

#define PIO0_25_4MA_DRIVE      AMDR_PIO_4MA_DRIVE               /**< \brief GPIO 4 mA驱动    */
#define PIO0_25_20MA_DRIVE     AMDR_PIO_20MA_DRIVE              /**< \brief GPIO 20 mA驱动   */
#define PIO0_25_STD_I2C        AMDR_FAST_STD_MODE               /**< \brief I2C快速/标准模式 */
#define PIO0_25_MOD_PLU_IIC    AMDR_FAST_MODE_PLUS              /**< \brief I2C超快速模式    */
#define PIO0_25_HIGH_I2C       AMDR_HIGH_SPEED_SLAVE            /**< \brief I2C高速从机模式  */

/** @} */


/******************************************************************************/

/**
 * \name PIO0_26引脚功能
 * @{
 */
#define PIO0_26_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO      */
#define PIO0_26_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入      */
#define PIO0_26_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出      */
#define PIO0_26_I2C1_SDA       AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief I2C1_SDA  */
#define PIO0_26_CT0_CAP3       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_CAP3  */

/** @} */

/**
 * \name PIO0_26 控制I2C引脚回转速率
 * @{
 */
#define PIO0_26_SLEWDISABLE    AMDR_GPIO_I2CSLEWBIT_CODE(0x0)   /**< \brief I2C模式   */
#define PIO0_26_SLEWENABLE     AMDR_GPIO_I2CSLEWBIT_CODE(0x1)   /**< \brief GPIO模式  */
/** @} */

/**
 * \name PIO0_26 输入极性
 * @{
 */
#define PIO0_26_INVDISABLE     AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_26_INVENABLE      AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_26 输入干扰滤波
 * @{
 */
#define PIO0_26_FILDISABLE     AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_26_FILENABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_26 控制引脚的电流驱动能力
 * @{
 */
#define PIO0_26_DRIVEDISABLE   AMDR_GPIO_I2CDRIVE_CODE(0x0)     /**< \brief 低驱动   */
#define PIO0_26_DRIVEENABLE    AMDR_GPIO_I2CDRIVE_CODE(0x1)     /**< \brief 高驱动   */
/** @} */

/**
 * \name PIO0_26 配置I2C的特性：标准模式、快速模式和超快速模式等
 * @{
 */
#define PIO0_26_FILTERENABLE   AMDR_GPIO_I2CFILTER_CODE(0x0)    /**< \brief 50 ns 脉冲滤波使能 */
#define PIO0_26_FILTERDISABLE  AMDR_GPIO_I2CFILTER_CODE(0x1)    /**< \brief 50 ns 脉冲滤波禁能 */
/** @} */

/**
 * \name PIO0_26 引脚的I2C功能
 * @{
 */

#define PIO0_26_4MA_DRIVE      AMDR_PIO_4MA_DRIVE               /**< \brief GPIO 4 mA驱动    */
#define PIO0_26_20MA_DRIVE     AMDR_PIO_20MA_DRIVE              /**< \brief GPIO 20 mA驱动   */
#define PIO0_26_STD_I2C        AMDR_FAST_STD_MODE               /**< \brief I2C快速/标准模式 */
#define PIO0_26_MOD_PLU_IIC    AMDR_FAST_MODE_PLUS              /**< \brief I2C超快速模式    */
#define PIO0_26_HIGH_I2C       AMDR_HIGH_SPEED_SLAVE            /**< \brief I2C高速从机模式  */

/** @} */


/******************************************************************************/

/**
 * \name PIO0_27引脚功能
 * @{
 */

#define PIO0_27_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO      */
#define PIO0_27_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入      */
#define PIO0_27_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出      */
#define PIO0_27_I2C2_SCL       AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief I2C2_SCL  */
#define PIO0_27_CT2_CAP0       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT2_CAP0  */

/** @} */

/**
 * \name PIO0_27 控制I2C引脚回转速率
 * @{
 */
#define PIO0_27_SLEWDISABLE    AMDR_GPIO_I2CSLEWBIT_CODE(0x0)   /**< \brief I2C模式   */
#define PIO0_27_SLEWENABLE     AMDR_GPIO_I2CSLEWBIT_CODE(0x1)   /**< \brief GPIO模式  */
/** @} */

/**
 * \name PIO0_27 输入极性
 * @{
 */
#define PIO0_27_INVDISABLE     AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_27_INVENABLE      AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_27 输入干扰滤波
 * @{
 */
#define PIO0_27_FILDISABLE     AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_27_FILENABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_27 控制引脚的电流驱动能力
 * @{
 */
#define PIO0_27_DRIVEDISABLE   AMDR_GPIO_I2CDRIVE_CODE(0x0)     /**< \brief 低驱动   */
#define PIO0_27_DRIVEENABLE    AMDR_GPIO_I2CDRIVE_CODE(0x1)     /**< \brief 高驱动   */
/** @} */

/**
 * \name PIO0_27 配置I2C的特性：标准模式、快速模式和超快速模式等
 * @{
 */
#define PIO0_27_FILTERENABLE   AMDR_GPIO_I2CFILTER_CODE(0x0)    /**< \brief 50 ns 脉冲滤波使能 */
#define PIO0_27_FILTERDISABLE  AMDR_GPIO_I2CFILTER_CODE(0x1)    /**< \brief 50 ns 脉冲滤波禁能 */
/** @} */

/**
 * \name PIO0_27 引脚的I2C功能
 * @{
 */

#define PIO0_27_4MA_DRIVE      AMDR_PIO_4MA_DRIVE               /**< \brief GPIO 4 mA驱动    */
#define PIO0_27_20MA_DRIVE     AMDR_PIO_20MA_DRIVE              /**< \brief GPIO 20 mA驱动   */
#define PIO0_27_STD_I2C        AMDR_FAST_STD_MODE               /**< \brief I2C快速/标准模式 */
#define PIO0_27_MOD_PLU_IIC    AMDR_FAST_MODE_PLUS              /**< \brief I2C超快速模式    */
#define PIO0_27_HIGH_I2C       AMDR_HIGH_SPEED_SLAVE            /**< \brief I2C高速从机模式  */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_28引脚功能
 * @{
 */

#define PIO0_28_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO0_28_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO0_28_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO0_28_I2C2_SDA       AMDR_GPIO_FUNC_CODE(0x1)         /**< \brief I2C2_SDA    */
#define PIO0_28_CT2_MAT0       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT2_MAT0    */

/** @} */

/**
 * \name PIO0_28 控制I2C引脚回转速率
 * @{
 */
#define PIO0_28_SLEWDISABLE    AMDR_GPIO_I2CSLEWBIT_CODE(0x0)   /**< \brief I2C模式   */
#define PIO0_28_SLEWENABLE     AMDR_GPIO_I2CSLEWBIT_CODE(0x1)   /**< \brief GPIO模式  */
/** @} */

/**
 * \name PIO0_28 输入极性
 * @{
 */
#define PIO0_28_INVDISABLE     AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO0_28_INVENABLE      AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_28 输入干扰滤波
 * @{
 */
#define PIO0_28_FILDISABLE     AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_28_FILENABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_28 控制引脚的电流驱动能力
 * @{
 */
#define PIO0_28_DRIVEDISABLE   AMDR_GPIO_I2CDRIVE_CODE(0x0)     /**< \brief 低驱动   */
#define PIO0_28_DRIVEENABLE    AMDR_GPIO_I2CDRIVE_CODE(0x1)     /**< \brief 高驱动   */
/** @} */


/**
 * \name PIO0_28 配置I2C的特性：标准模式、快速模式和超快速模式等
 * @{
 */
#define PIO0_28_FILTERENABLE   AMDR_GPIO_I2CFILTER_CODE(0x0)    /**< \brief 50 ns 脉冲滤波使能 */
#define PIO0_28_FILTERDISABLE  AMDR_GPIO_I2CFILTER_CODE(0x1)    /**< \brief 50 ns 脉冲滤波禁能 */
/** @} */


/**
 * \name PIO0_28 引脚的I2C功能
 * @{
 */

