Poco-Ye/ZLG_lpc1765_ametal/ametal/lpc5410x/hw/include/lpc5410x_pin.h
#define PIO0_28_4MA_DRIVE      AMDR_PIO_4MA_DRIVE               /**< \brief GPIO 4 mA驱动    */
#define PIO0_28_20MA_DRIVE     AMDR_PIO_20MA_DRIVE              /**< \brief GPIO 20 mA驱动   */
#define PIO0_28_STD_I2C        AMDR_FAST_STD_MODE               /**< \brief I2C快速/标准模式 */
#define PIO0_28_MOD_PLU_IIC    AMDR_FAST_MODE_PLUS              /**< \brief I2C超快速模式    */
#define PIO0_28_HIGH_I2C       AMDR_HIGH_SPEED_SLAVE            /**< \brief I2C高速从机模式  */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_29引脚功能
 * @{
 */

#define PIO0_29_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO       */
#define PIO0_29_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入       */
#define PIO0_29_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出       */
#define PIO0_29_ADC_IN0        AMDR_GPIO_ADC_FUNC_CODE(0x0)     /**< \brief ADC_IN0    */
#define PIO0_29_SCT0_OUT2      AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SCT0_OUT2  */
#define PIO0_29_CT0_MAT3       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_MAT3   */
#define PIO0_29_CT0_CAP1       AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief CT0_CAP1   */
#define PIO0_29_CT0_MAT1       AMDR_GPIO_FUNC_CODE(0x6)         /**< \brief CT0_MAT1   */

/** @} */

/**
 * \name PIO0_29功能模式
 * @{
 */
 
#define PIO0_29_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_29_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_29_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_29_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_29 输入极性
 * @{
 */
#define PIO0_29_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_29_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_29 输入干扰滤波
 * @{
 */
#define PIO0_29_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_29_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_29 开漏模式
 * @{
 */
#define PIO0_29_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_29_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO0_30引脚功能
 * @{
 */

#define PIO0_30_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO      */
#define PIO0_30_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入      */
#define PIO0_30_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出      */
#define PIO0_30_ADC_IN1        AMDR_GPIO_ADC_FUNC_CODE(0x0)     /**< \brief ADC_IN1   */
#define PIO0_30_SCT0_OUT3      AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SCT0_OUT3 */
#define PIO0_30_CT0_MAT2       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_MAT2  */                       
#define PIO0_30_CT0_CAP2       AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief CT0_CAP2  */

/** @} */

/**
 * \name PIO0_30功能模式
 * @{
 */
 
#define PIO0_30_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_30_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_30_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_30_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_30 输入极性
 * @{
 */
#define PIO0_30_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_30_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_30 输入干扰滤波
 * @{
 */
#define PIO0_30_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_30_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_30 开漏模式
 * @{
 */
#define PIO0_30_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_30_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/
 
/**
 * \name PIO0_31引脚功能
 * @{
 */  

#define PIO0_31_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO0_31_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO0_31_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO0_31_ADC_IN2        AMDR_GPIO_ADC_FUNC_CODE(0x0)     /**< \brief ADC_IN2     */
#define PIO0_31_USART2_CTS     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief USART2_CTS  */
#define PIO0_31_CT2_CAP2       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT2_CAP2    */
#define PIO0_31_CT0_CAP3       AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief CT0_CAP3    */
#define PIO0_31_CT0_MAT3       AMDR_GPIO_FUNC_CODE(0x6)         /**< \brief CT0_MAT3    */

/** @} */

/**
 * \name PIO0_31功能模式
 * @{
 */
 
#define PIO0_31_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO0_31_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO0_31_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO0_31_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO0_31 输入极性
 * @{
 */
#define PIO0_31_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO0_31_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO0_31 输入干扰滤波
 * @{
 */
#define PIO0_31_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO0_31_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO0_31 开漏模式
 * @{
 */
#define PIO0_31_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO0_31_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_0引脚功能
 * @{
 */

#define PIO1_0_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO       */
#define PIO1_0_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入       */
#define PIO1_0_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出       */
#define PIO1_0_ADC_IN3         AMDR_GPIO_ADC_FUNC_CODE(0x0)     /**< \brief ADC_IN3    */
#define PIO1_0_USART2_RTS      AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief USART2_RTS */
#define PIO1_0_CT3_MAT1        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT3_MAT1   */
#define PIO1_0_CT0_CAP0        AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief CT0_CAP0   */

/** @} */

/**
 * \name PIO1_0功能模式
 * @{
 */
 
#define PIO1_0_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_0_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO1_0_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO1_0_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_0 输入极性
 * @{
 */
#define PIO1_0_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO1_0_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_0 输入干扰滤波
 * @{
 */
#define PIO1_0_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_0_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_0 开漏模式
 * @{
 */
#define PIO1_0_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO1_0_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_1引脚功能
 * @{
 */

