Poco-Ye/ZLG_lpc1765_ametal/ametal/lpc5410x/hw/include/lpc5410x_pin.h
#define PIO1_1_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO      */
#define PIO1_1_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入      */
#define PIO1_1_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出      */
#define PIO1_1_ADC_IN4         AMDR_GPIO_ADC_FUNC_CODE(0x0)     /**< \brief ADC_IN4   */
#define PIO1_1_SWO             AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SWO       */
#define PIO1_1_SCT0_OUT4       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief SCT0_OUT4 */

/** @} */ 

/**
 * \name PIO1_1功能模式
 * @{
 */
 
#define PIO1_1_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_1_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO1_1_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO1_1_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_1 输入极性
 * @{
 */
#define PIO1_1_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO1_1_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_1 输入干扰滤波
 * @{
 */
#define PIO1_1_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_1_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_1 开漏模式
 * @{
 */
#define PIO1_1_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO1_1_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_2引脚功能
 * @{
 */

#define PIO1_2_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO          */
#define PIO1_2_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入          */
#define PIO1_2_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出          */
#define PIO1_2_ADC_IN5         AMDR_GPIO_ADC_FUNC_CODE(0x0)     /**< \brief ADC_IN5       */
#define PIO1_2_SPI1_SSELN3     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SPI1_SSELN3   */
#define PIO1_2_SSCT0_OUT5      AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief SCT0_OUT5     */

/** @} */

/**
 * \name PIO1_2功能模式
 * @{
 */
 
#define PIO1_2_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_2_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO1_2_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO1_2_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_2 输入极性
 * @{
 */
#define PIO1_2_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO1_2_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_2 输入干扰滤波
 * @{
 */
#define PIO1_2_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_2_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_2 开漏模式
 * @{
 */
#define PIO1_2_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO1_2_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_3引脚功能
 * @{
 */

#define PIO1_3_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO1_3_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO1_3_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO1_3_ADC_IN6         AMDR_GPIO_ADC_FUNC_CODE(0x0)     /**< \brief ADC_IN6     */
#define PIO1_3_SPI1_SSELN2     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SPI1_SSELN2 */
#define PIO1_3_SCT0_OUT6       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief SCT0_OUT6   */
#define PIO1_3_SPI0_SCK        AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief SPI0_SCK    */
#define PIO1_3_CT0_CAP1        AMDR_GPIO_FUNC_CODE(0x6)         /**< \brief CT0_CAP1    */

/** @} */

/**
 * \name PIO1_3功能模式
 * @{
 */
 
#define PIO1_3_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_3_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO1_3_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO1_3_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_3 输入极性
 * @{
 */
#define PIO1_3_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO1_3_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_3 输入干扰滤波
 * @{
 */
#define PIO1_3_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_3_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_3 开漏模式
 * @{
 */
#define PIO1_3_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO1_3_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_4引脚功能
 * @{
 */

#define PIO1_4_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO1_4_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO1_4_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO1_4_ADC_IN7         AMDR_GPIO_ADC_FUNC_CODE(0x0)     /**< \brief ADC_IN7     */
#define PIO1_4_SPI1_SSELN1     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SPI1_SSELN1 */
#define PIO1_4_SCT0_OUT7       AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief SCT0_OUT7   */
#define PIO1_4_SPI0_MISO       AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief SPI0_MISO   */
#define PIO1_4_CT0_MAT1        AMDR_GPIO_FUNC_CODE(0x6)         /**< \brief CT0_MAT1    */

/** @} */

/**
 * \name PIO1_4功能模式
 * @{
 */
 
