Poco-Ye/ZLG_lpc1765_ametal/ametal/lpc5410x/hw/include/lpc5410x_pin.h
#define PIO1_4_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_4_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO1_4_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO1_4_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_4 输入极性
 * @{
 */
#define PIO1_4_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO1_4_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_4 输入干扰滤波
 * @{
 */
#define PIO1_4_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_4_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_4 开漏模式
 * @{
 */
#define PIO1_4_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO1_4_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_5引脚功能
 * @{
 */

#define PIO1_5_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO1_5_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO1_5_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO1_5_ADC_IN8         AMDR_GPIO_ADC_FUNC_CODE(0x0)     /**< \brief  ADC_IN8    */
#define PIO1_5_SPI1_SSELN0     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SPI1_SSELN0 */
#define PIO1_5_CT1_CAP0        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT1_CAP0    */
#define PIO1_5_CT1_MAT3        AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief CT1_MAT3    */

/** @} */

/**
 * \name PIO1_5功能模式
 * @{
 */
 
#define PIO1_5_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_5_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO1_5_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO1_5_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_5 输入极性
 * @{
 */
#define PIO1_5_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO1_5_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_5 输入干扰滤波
 * @{
 */
#define PIO1_5_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_5_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_5 开漏模式
 * @{
 */
#define PIO1_5_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO1_5_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_6引脚功能
 * @{
 */

#define PIO1_6_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO     */
#define PIO1_6_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入     */
#define PIO1_6_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出     */
#define PIO1_6_ADC_IN9         AMDR_GPIO_ADC_FUNC_CODE(0x0)     /**< \brief ADC_IN9  */
#define PIO1_6_SPI1_SCK        AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SPI1_SCK */
#define PIO1_6_CT1_CAP2        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT1_CAP2 */
#define PIO1_6_CT1_MAT2        AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief CT1_MAT2 */
/** @} */

/**
 * \name PIO1_6功能模式
 * @{
 */
 
#define PIO1_6_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_6_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO1_6_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO1_6_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_6 输入极性
 * @{
 */
#define PIO1_6_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO1_6_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_6 输入干扰滤波
 * @{
 */
#define PIO1_6_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_6_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_6 开漏模式
 * @{
 */
#define PIO1_6_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO1_6_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_7引脚功能
 * @{
 */

#define PIO1_7_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO      */
#define PIO1_7_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入      */
#define PIO1_7_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出      */
#define PIO1_7_ADC_IN10        AMDR_GPIO_ADC_FUNC_CODE(0x0)     /**< \brief ADC_IN10  */
#define PIO1_7_SPI1_MOSI       AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SPI1_MOSI */
#define PIO1_7_CT1_MAT2        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT1_MAT2  */
#define PIO1_7_CT1_CAP2        AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief CT1_CAP2  */

/** @} */

/**
 * \name PIO1_7功能模式
 * @{
 */
 
#define PIO1_7_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_7_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO1_7_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO1_7_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_7 输入极性
 * @{
 */
#define PIO1_7_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO1_7_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_7 输入干扰滤波
 * @{
 */
#define PIO1_7_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_7_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_7 开漏模式
 * @{
 */
#define PIO1_7_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO1_7_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_8引脚功能
 * @{
 */

#define PIO1_8_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO      */
#define PIO1_8_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入      */
#define PIO1_8_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出      */
#define PIO1_8_ADC_IN11        AMDR_GPIO_ADC_FUNC_CODE(0x0)     /**< \brief ADC_IN11  */
#define PIO1_8_SPI1_MISO       AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SPI1_MISO */
#define PIO1_8_CT1_MAT3        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT1_MAT3  */
#define PIO1_8_CT1_CAP3        AMDR_GPIO_FUNC_CODE(0x5)         /**< \brief CT1_CAP3  */

/** @} */

/**
 * \name PIO1_8功能模式
 * @{
 */
 
#define PIO1_8_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_8_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO1_8_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO1_8_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_8 输入极性
 * @{
 */
#define PIO1_8_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO1_8_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_8 输入干扰滤波
 * @{
 */
#define PIO1_8_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_8_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_8 开漏模式
 * @{
 */
#define PIO1_8_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO1_8_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_9引脚功能
 * @{
 */

#define PIO1_9_GPIO            AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO1_9_INPUT           AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO1_9_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO1_9_SPI0_MOSI       AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief SPI0_MOSI   */
#define PIO1_9_CT0_CAP2        AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief CT0_CAP2    */

/** @} */

/**
 * \name PIO1_9功能模式
 * @{
 */
 
#define PIO1_9_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)         /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_9_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)         /**< \brief 下拉模式              */
#define PIO1_9_PULLUP          AMDR_GPIO_MODE_CODE(0x2)         /**< \brief 上拉模式              */
#define PIO1_9_REPEATER        AMDR_GPIO_MODE_CODE(0x3)         /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_9 输入极性
 * @{
 */
#define PIO1_9_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)    /**< \brief 不反转   */
#define PIO1_9_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)    /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_9 输入干扰滤波
 * @{
 */
#define PIO1_9_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_9_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_9 驱动回转速率
 * @{
 */
#define PIO1_9_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)      /**< \brief 标准模式 */
#define PIO1_9_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)      /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO1_9 开漏模式
 * @{
 */
#define PIO1_9_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)        /**< \brief 正常     */
#define PIO1_9_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)        /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_10引脚功能
 * @{
 */

#define PIO1_10_GPIO           AMDR_GPIO_FUNC_CODE(0x0)         /**< \brief GPIO        */
#define PIO1_10_INPUT          AMDR_GPIO_DIR_CODE(0x0)          /**< \brief 输入        */
#define PIO1_10_OUTPUT         AMDR_GPIO_DIR_CODE(0x1)          /**< \brief 输出        */
#define PIO1_10_USART1_TXD     AMDR_GPIO_FUNC_CODE(0x2)         /**< \brief USART1_TXD  */
#define PIO1_10_SCT0_OUT4      AMDR_GPIO_FUNC_CODE(0x3)         /**< \brief SCT0_OUT4   */

/** @} */

/**
 * \name PIO1_10功能模式
 * @{
 */
 
#define PIO1_10_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_10_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO1_10_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO1_10_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_10 输入极性
 * @{
 */
#define PIO1_10_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO1_10_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_10 输入干扰滤波
 * @{
 */
#define PIO1_10_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_10_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_10 驱动回转速率
 * @{
 */
#define PIO1_10_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO1_10_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO1_10 开漏模式
 * @{
 */
#define PIO1_10_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO1_10_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_11引脚功能
 * @{
 */

#define PIO1_11_GPIO            AMDR_GPIO_FUNC_CODE(0x0)        /**< \brief GPIO       */
#define PIO1_11_INPUT           AMDR_GPIO_DIR_CODE(0x0)         /**< \brief 输入       */
#define PIO1_11_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)         /**< \brief 输出       */
#define PIO1_11_USART1_RTS      AMDR_GPIO_FUNC_CODE(0x2)        /**< \brief USART1_RTS */
#define PIO1_11_CT1_CAP0        AMDR_GPIO_FUNC_CODE(0x3)        /**< \brief CT1_CAP0   */

/** @} */

/**
 * \name PIO1_11功能模式
 * @{
 */
 
#define PIO1_11_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_11_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO1_11_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO1_11_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_11 输入极性
 * @{
 */
#define PIO1_11_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO1_11_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_11 输入干扰滤波
 * @{
 */
#define PIO1_11_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_11_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_11 驱动回转速率
 * @{
 */
#define PIO1_11_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO1_11_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO1_11 开漏模式
 * @{
 */
#define PIO1_11_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO1_11_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_12引脚功能
 * @{
 */

