Poco-Ye/ZLG_lpc1765_ametal/ametal/lpc5410x/hw/include/lpc5410x_pin.h
#define PIO1_12_GPIO            AMDR_GPIO_FUNC_CODE(0x0)        /**< \brief GPIO       */
#define PIO1_12_INPUT           AMDR_GPIO_DIR_CODE(0x0)         /**< \brief 输入       */
#define PIO1_12_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)         /**< \brief 输出       */
#define PIO1_12_USART3_RXD      AMDR_GPIO_FUNC_CODE(0x2)        /**< \brief USART3_RXD */
#define PIO1_12_CT1_MAT0        AMDR_GPIO_FUNC_CODE(0x3)        /**< \brief CT1_MAT0   */
#define PIO1_12_SPI1_SCK        AMDR_GPIO_FUNC_CODE(0x4)        /**< \brief SPI1_SCK   */

/** @} */

/**
 * \name PIO1_12功能模式
 * @{
 */
 
#define PIO1_12_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_12_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO1_12_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO1_12_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_12 输入极性
 * @{
 */
#define PIO1_12_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO1_12_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_12 输入干扰滤波
 * @{
 */
#define PIO1_12_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_12_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_12 驱动回转速率
 * @{
 */
#define PIO1_12_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO1_12_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO1_12 开漏模式
 * @{
 */
#define PIO1_12_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO1_12_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_13引脚功能
 * @{
 */

#define PIO1_13_GPIO            AMDR_GPIO_FUNC_CODE(0x0)        /**< \brief GPIO       */
#define PIO1_13_INPUT           AMDR_GPIO_DIR_CODE(0x0)         /**< \brief 输入       */
#define PIO1_13_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)         /**< \brief 输出       */
#define PIO1_13_USART3_TXD      AMDR_GPIO_FUNC_CODE(0x2)        /**< \brief USART3_TXD */
#define PIO1_13_CT1_MAT1        AMDR_GPIO_FUNC_CODE(0x3)        /**< \brief CT1_MAT1   */
#define PIO1_13_SPI1_MOSI       AMDR_GPIO_FUNC_CODE(0x4)        /**< \brief SPI1_MOSI  */

/** @} */

/**
 * \name PIO1_13功能模式
 * @{
 */
 
#define PIO1_13_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_13_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO1_13_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO1_13_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_13 输入极性
 * @{
 */
#define PIO1_13_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO1_13_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_13 输入干扰滤波
 * @{
 */
#define PIO1_13_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_13_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_13 驱动回转速率
 * @{
 */
#define PIO1_13_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO1_13_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO1_13 开漏模式
 * @{
 */
#define PIO1_13_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO1_13_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_14引脚功能
 * @{
 */

#define PIO1_14_GPIO            AMDR_GPIO_FUNC_CODE(0x0)        /**< \brief GPIO         */
#define PIO1_14_INPUT           AMDR_GPIO_DIR_CODE(0x0)         /**< \brief 输入         */
#define PIO1_14_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)         /**< \brief 输出         */
#define PIO1_14_USART2_RXD      AMDR_GPIO_FUNC_CODE(0x2)        /**< \brief USART2_RXD   */
#define PIO1_14_SCT0_OUT7       AMDR_GPIO_FUNC_CODE(0x3)        /**< \brief SCT0_OUT7    */
#define PIO1_14_SPI1_MISO       AMDR_GPIO_FUNC_CODE(0x4)        /**< \brief SPI1_MISO    */

/** @} */

/**
 * \name PIO1_14功能模式
 * @{
 */
 
#define PIO1_14_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_14_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO1_14_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO1_14_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_14 输入极性
 * @{
 */
#define PIO1_14_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO1_14_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_14 输入干扰滤波
 * @{
 */
#define PIO1_14_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_14_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_14 驱动回转速率
 * @{
 */
#define PIO1_14_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO1_14_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO1_14 开漏模式
 * @{
 */
#define PIO1_14_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO1_14_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/******************************************************************************/

/**
 * \name PIO1_15引脚功能
 * @{
 */

#define PIO1_15_GPIO            AMDR_GPIO_FUNC_CODE(0x0)        /**< \brief GPIO        */
#define PIO1_15_INPUT           AMDR_GPIO_DIR_CODE(0x0)         /**< \brief 输入        */
#define PIO1_15_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)         /**< \brief 输出        */
#define PIO1_15_SCT0_OUT5       AMDR_GPIO_FUNC_CODE(0x2)        /**< \brief SCT0_OUT5   */
#define PIO1_15_CT1_CAP3        AMDR_GPIO_FUNC_CODE(0x3)        /**< \brief CT1_CAP3    */
#define PIO1_15_SPI1_SSELN0     AMDR_GPIO_FUNC_CODE(0x4)        /**< \brief SPI1_SSELN0 */

/** @} */

/**
 * \name PIO1_15功能模式
 * @{
 */
 
#define PIO1_15_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_15_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO1_15_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO1_15_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_15 输入极性
 * @{
 */
#define PIO1_15_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO1_15_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_15 输入干扰滤波
 * @{
 */
#define PIO1_15_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_15_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_15 驱动回转速率
 * @{
 */
#define PIO1_15_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO1_15_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO1_15 开漏模式
 * @{
 */
#define PIO1_15_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO1_15_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_16引脚功能
 * @{
 */

#define PIO1_16_GPIO            AMDR_GPIO_FUNC_CODE(0x0)        /**< \brief GPIO        */
#define PIO1_16_INPUT           AMDR_GPIO_DIR_CODE(0x0)         /**< \brief 输入        */
#define PIO1_16_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)         /**< \brief 输出        */
#define PIO1_16_CT0_MAT0        AMDR_GPIO_FUNC_CODE(0x2)        /**< \brief CT0_MAT0    */
#define PIO1_16_CT0_CAP0        AMDR_GPIO_FUNC_CODE(0x3)        /**< \brief CT0_CAP0    */
#define PIO1_16_SPI1_SSELN1     AMDR_GPIO_FUNC_CODE(0x4)        /**< \brief SPI1_SSELN1 */

/** @} */

/**
 * \name PIO1_16功能模式
 * @{
 */
 
#define PIO1_16_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_16_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO1_16_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO1_16_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_16 输入极性
 * @{
 */
#define PIO1_16_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO1_16_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_16 输入干扰滤波
 * @{
 */
#define PIO1_16_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_16_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_16 驱动回转速率
 * @{
 */
#define PIO1_16_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO1_16_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO1_16 开漏模式
 * @{
 */
#define PIO1_16_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO1_16_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */

/******************************************************************************/

/**
 * \name PIO1_17引脚功能
 * @{
 */

