Poco-Ye/ZLG_lpc1765_ametal/ametal/lpc5410x/hw/include/lpc5410x_pin.h
#define PIO1_17_GPIO            AMDR_GPIO_FUNC_CODE(0x0)        /**< \brief GPIO          */
#define PIO1_17_INPUT           AMDR_GPIO_DIR_CODE(0x0)         /**< \brief 输入          */
#define PIO1_17_OUTPUT          AMDR_GPIO_DIR_CODE(0x1)         /**< \brief 输出          */

/** @} */

/**
 * \name PIO1_17功能模式
 * @{
 */
 
#define PIO1_17_INACTIVE        AMDR_GPIO_MODE_CODE(0x0)        /**< \brief 消极模式(无上拉/下拉) */
#define PIO1_17_PULLDOWN        AMDR_GPIO_MODE_CODE(0x1)        /**< \brief 下拉模式              */
#define PIO1_17_PULLUP          AMDR_GPIO_MODE_CODE(0x2)        /**< \brief 上拉模式              */
#define PIO1_17_REPEATER        AMDR_GPIO_MODE_CODE(0x3)        /**< \brief 中继模式              */

/** @} */

/**
 * \name PIO1_17 输入极性
 * @{
 */
#define PIO1_17_INVDISABLE      AMDR_GPIO_INVERTBIT_CODE(0x0)   /**< \brief 不反转   */
#define PIO1_17_INVENABLE       AMDR_GPIO_INVERTBIT_CODE(0x1)   /**< \brief 反转     */
/** @} */

/**
 * \name PIO1_17 输入干扰滤波
 * @{
 */
#define PIO1_17_FILDISABLE      AMDR_GPIO_FILTEROFFBIT_CODE(0x1) /**< \brief 滤波使能 */
#define PIO1_17_FILENABLE       AMDR_GPIO_FILTEROFFBIT_CODE(0x0) /**< \brief 滤波禁能 */
/** @} */

/**
 * \name PIO1_17 驱动回转速率
 * @{
 */
#define PIO1_17_SLEWDISABLE     AMDR_GPIO_SLEWBIT_CODE(0x0)     /**< \brief 标准模式 */
#define PIO1_17_SLEWENABLE      AMDR_GPIO_SLEWBIT_CODE(0x1)     /**< \brief 快速模式 */
/** @} */

/**
 * \name PIO1_17 开漏模式
 * @{
 */
#define PIO1_17_ODDISABLE       AMDR_GPIO_ODBIT_CODE(0x0)       /**< \brief 正常     */
#define PIO1_17_ODENABLE        AMDR_GPIO_ODBIT_CODE(0x1)       /**< \brief 开漏     */
/** @} */


/** 
 * @}
 */

/**
 * @} amhw_if_pin
 */

#ifdef __cplusplus
}
#endif

#endif /* __LPC5410X_PIN_H */

/* end of file */
